#---------------------------------------------------------------------------#

def draw_pyramid():
  # รับค่าพารามิเตอร์จากผู้ใช้ภายในฟังก์ชัน
  num_stars = int(input("ใส่จำนวนแถว: "))

  # วาดรูปพีรมิด
  for i in range(num_stars):
    print(" " * (num_stars - i - 1) + "*" * (2 * i + 1))


def draw_invert_pyramid():
  # รับค่าพารามิเตอร์จากผู้ใช้ภายในฟังก์ชัน
  num_stars = int(input("ใส่จำนวนแถว: "))

  # วาดรูปพีรมิดกลับด้าน
  for i in range(num_stars):
    print(" " * i + "*" * (num_stars * 2 - 2 * i - 1))


def draw_triangle():
  # รับค่าพารามิเตอร์จากผู้ใช้ภายในฟังก์ชัน
  num_stars = int(input("ใส่จำนวนแถว: "))

  # วาดรูปสามเหลื่ยม
  for i in range(num_stars):
    print( "*" * (num_stars - i))


#---------------------------------------------------------------------------#

def main():
  while True:
    print('-'*30)
    print("โปรแกรมวาดภาพ")
    print('-'*30)
    # รับค่าพารามิเตอร์จากผู้ใช้เพื่อเลือกประเภทภาพที่ต้องการจะวาด
    type = input("เลือกประเภทภาพที่ต้องการจะวาด \n     1 : พีรมิด \n     2 : พีรมิดกลับด้าน \n     3 : สามเหลื่ยม \n"+ ("-"*20) +"\n  กรอกหมายเลขของประเภทรูปภาพ : ")
    print('-'*30)
    if type == "1":
        draw_pyramid()
    elif type == "2":
        draw_invert_pyramid()
    elif type == "3":
        draw_triangle()
    else:
        print("ตัวเลือกไม่ถูกต้อง")
     
    # ตรวจสอบว่าผู้ใช้ต้องการออกหรือไม่
    choice = input("ต้องการออกหรือไม่ (y/n): ")
    if choice.lower() == "y":
      break
    elif choice.lower() == "n":
      continue
    else:
      print("ตัวเลือกไม่ถูกต้อง")

  print("--- โปรแกรมเสร็จสิ้นการทำงาน ---")
  print('-'*30)
if __name__ == "__main__":
  main()

  #---------------------------------------------------------------------------#